remotemcu/remcu-chip-sdks/freescale/KSDK_1.3/platform/system/src/clock/MKW30Z4/fsl_clock_MKW30Z4.c
    SIM_HAL_DisableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, i2cGateTable[instance]);
}

/* Lpuart instance table. */
static const sim_clock_gate_name_t lpuartGateTable[] =
{
    kSimClockGateLpuart0
};

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableLpuartClock
 * Description   : Enable the clock for LPUART module
 * This function enables the clock for LPUART moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_EnableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableLpuartClock
 * Description   : Disable the clock for LPUART module
 * This function enables the clock for LPUART moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_DisableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetLpuartGateCmd
 * Description   : Get the the clock gate state for LPUART module
 * This function will get the clock gate state for LPUART moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetLpuartGateCmd(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, lpuartGateTable[instance]);
}

/* FTM instance table. */
static const sim_clock_gate_name_t tpmGateTable[] =
{
    kSimClockGateTpm0,
    kSimClockGateTpm1,
    kSimClockGateTpm2
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableTpmClock
 * Description   : Enable the clock for TPM module
 * This function enables the clock for TPM moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_EnableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableTpmClock
 * Description   : Disable the clock for TPM module
 * This function disables the clock for TPM moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableTpmClock(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    SIM_HAL_DisableClock(SIM, tpmGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetTpmGateCmd
 * Description   : Get the the clock gate state for TPM module
 * This function will get the clock gate state for TPM moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetTpmGateCmd(uint32_t instance)
{
    assert(instance < sizeof(tpmGateTable)/sizeof(tpmGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, tpmGateTable[instance]);
}

/* Ltc instance table. */
static const sim_clock_gate_name_t ltcGateTable[] =
{
    kSimClockGateLtc
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableLtcClock
 * Description   : Enable the clock for LTC module
 * This function enables the clock for LTC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableLtcClock(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    SIM_HAL_EnableClock(SIM, ltcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableLtcClock
 * Description   : Disable the clock for LTC module
 * This function enables the clock for LTC moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableLtcClock(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    SIM_HAL_DisableClock(SIM, ltcGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLtcGateCmd
 * Description   : Get the the clock gate state for LTC module
 * This function will get the clock gate state for LTC moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetLtcGateCmd(uint32_t instance)
{
    assert(instance < sizeof(ltcGateTable)/sizeof(ltcGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, ltcGateTable[instance]);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
